/**
 * Created by 前端 on 2017/12/26.
 */

/**
 * 敏感词 top10*
 * 【个人群组的格式都是如下：】
 * 另有筛选条件【今天,近七天,近一个月，近三个月】
 * **/
result = {
    "msg":"Success",
    "code":0,
    "data":[
        {"name":"大麻","value":1690},
        {"name":"嗑药","value":1677},
        {"name":"摇头丸","value":1640},
        {"name":"冰毒","value":1630},
        {"name":"致幻蘑菇","value":1081},
        {"name":"特工","value":1012},
        {"name":"自杀","value":517},
        {"name":"地狱","value":457},
        {"name":"沉沦","value":409},
        {"name":"死亡","value":209}
    ]
};

/**
 * 热词 top10*
 * 【个人群组的格式都是如下：】
 * 另有筛选条件【今天,近七天,近一个月，近三个月】
 * **/
result ={
    "msg":"Success",
    "code":0,
    "data":[
        {"name":"QQ","value":1777},
        {"name":"微信","value":1384},
        {"name":"纷享销客","value":1348},
        {"name":"销售易","value":1009},
        {"name":"陌陌","value":964},
        {"name":"探探","value":812},
        {"name":"腾讯新闻","value":456},
        {"name":"工作圈","value":231},
        {"name":"网易读书","value":203},
        {"name":"Facebook","value":156}
    ]
};


/**
 * 内容信息类型收发走势*
 * 【今天,近七天,近一个月，近三个月的格式都是如下：
 * 数组每项分别代表：文字，音频，url,图片，视频】
 * 另有筛选条件【个人,群组】
 * **/

var data = [
    [40,55,132,50,90],
    [60,15,102,70,30],
    [88,25,32,90,180],
    [88,25,32,90,180]
];


/**
 * 内容信息类型收发走势*
 * 【今天,近七天,近一个月，近三个月的格式都是如下：
 * 数组每项分别代表：第几根轴,top项序号,value值,人的姓名/或者群组名称】
 * 另有筛选条件【个人,群组】
 * **/

var data = [
    [0,0,5,'小明'],
    [0,1,1,'小海'],
    [0,2,0,'小凌'],
    [0,3,12,'小峰'],
    [0,4,0,'小婷'],
    [0,5,4,'小花'],
    [0,6,8,'小画'],
    [0,7,9,'小英'],
    [0,8,6,'小东'],
    [0,9,11,'小杨'],

    [1,0,7,'小明'],
    [1,1,3,'小海'],
    [1,2,9,'小凌'],
    [1,3,0,'小峰'],
    [1,4,4,'小婷'],
    [1,5,9,'小花'],
    [1,6,7,'小画'],
    [1,7,4,'小英'],
    [1,8,0,'小东'],
    [1,9,10,'小杨'],

    [2,0,1,'小明'],
    [2,1,1,'小海'],
    [2,2,3,'小凌'],
    [2,3,9,'小峰'],
    [2,4,7,'小婷'],
    [2,5,0,'小花'],
    [2,6,5,'小画'],
    [2,7,8,'小英'],
    [2,8,0,'小东'],
    [2,9,5,'小杨'],

    [3,0,7,'小明'],
    [3,1,3,'小海'],
    [3,2,0,'小凌'],
    [3,3,5,'小峰'],
    [3,4,0,'小婷'],
    [3,5,12,'小花'],
    [3,6,10,'小画'],
    [3,7,0,'小英'],
    [3,8,1,'小东'],
    [3,9,3,'小杨']
]


/**
 * main主图*
 * 【敏感词近三个月的总排名格式都是如下：
 * 这里的王子的骑士，鹿晗表示敏感词；李明11，牛人宝典，杨进等表示针对这些敏感词人的收发量。
 * **/
var rawData= {
    "王子的骑士":{
        "$count":2303,
        "李明11":{
            "$count":900,
        },
        "李明22":{
            "$count":1200,
        },
        "李明33":{
            "$count":700,
        },
        "李明44":{
            "$count":800,
        },
        "李明55":{
            "$count":600,
        },
        "李明66":{
            "$count":500,
        },
        "李明77":{
            "$count":2000,
        },
        "李明88":{
            "$count":1600,
        },
        "李明99":{
            "$count":1000,
        },
        "李明1010":{
            "$count":1200,
        }

    },
    "鹿晗":{
        "$count":1000,
        "鹿晗饭团":{
            "$count":900
        },
        "鹿晗饭团":{
            "$count":100
        }
    },
    "牛人":{
        "$count":1200,
        "牛人宝典":{
            "$count":200,
        },
        "牛人宝典11":{
            "$count":1000,
        }
    },
    "胡歌":{
        "$count":1100,
        "杨进":{
            "$count":200,
        }
    },
    "细嗅蔷薇":{
        "$count":1000,
        "细":{
            "$count":200,
        }
    },
    "敷衍":{
        "$count":950,
        "父":{
            "$count":200,
        }
    },
    "自道":{
        "$count":900,
        "郭沫若":{
            "$count":200,
        }
    },
    "妇随":{
        "$count":1200,
        "都附和":{
            "$count":300,
        }
    },
    "系道":{
        "$count":850,
        "郭沫若":{
            "$count":400,
        }
    },
    "黑道":{
        "$count":800,
        "郭沫若":{
            "$count":300,
        }
    }
}